cases/Ferrari_200deg/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 80 0 0 );

boundaryField
{
    #includeEtc     "caseDicts/setConstraintTypes"
    farfield
    {
        type            freestreamVelocity;
        freestreamValue uniform ( 80 0 0 );
        value           uniform ( 80 0 0 );
    }
    mainWing
    {
        type            noSlip;
    }
    flap
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }
    nonCouple1
    {
        type            movingWallSlipVelocity;
        value           uniform ( 80 0 0 );
    }
    nonCouple2
    {
        type            movingWallSlipVelocity;
        value           uniform ( 80 0 0 );
    }
}


// ************************************************************************* //
