cases/Ferrari_200deg/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 128;

boundaryField
{
    #includeEtc     "caseDicts/setConstraintTypes"
    farfield
    {
        type            freestream;
        freestreamValue uniform 128;
        value           uniform 128;
    }
    mainWing
    {
        type            omegaWallFunction;
        value           uniform 128;
    }
    flap
    {
        type            omegaWallFunction;
        value           uniform 128;
    }
    nonCouple1
    {
        type            zeroGradient;
    }
    nonCouple2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
