cases/Ferrari_200deg/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// Ferrari-style 200 deg flap motion:
//
// Prescribed mesh rotation: -200 deg
//
// 0.000–0.050 s: hold initial position
// 0.050–0.450 s: smooth prescribed rotation
// 0.450 s onward: hold final position

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    cellZone        rotor;

    solidBodyMotionFunction  rotatingMotion;

    origin          (0.290000 0.050000 0.100000);
    axis            (0 0 1);

    omega           table
    (
            (0.000000 0.000000000000)
            (0.050000 -0.000000000000)
            (0.060000 -1.076053521940)
            (0.070000 -2.145472816100)
            (0.080000 -3.201664556900)
            (0.090000 -4.238116971040)
            (0.100000 -5.248439984750)
            (0.110000 -6.226404620660)
            (0.120000 -7.165981401600)
            (0.130000 -8.061377524270)
            (0.140000 -8.907072573810)
            (0.150000 -9.697852559040)
            (0.160000 -10.428842058380)
            (0.170000 -11.095534278490)
            (0.180000 -11.693818840130)
            (0.190000 -12.220007120040)
            (0.200000 -12.670854992480)
            (0.210000 -13.043582830410)
            (0.220000 -13.335892642750)
            (0.230000 -13.545982242320)
            (0.240000 -13.672556356870)
            (0.250000 -13.714834614890)
            (0.260000 -13.672556356870)
            (0.270000 -13.545982242320)
            (0.280000 -13.335892642750)
            (0.290000 -13.043582830410)
            (0.300000 -12.670854992480)
            (0.310000 -12.220007120040)
            (0.320000 -11.693818840130)
            (0.330000 -11.095534278490)
            (0.340000 -10.428842058380)
            (0.350000 -9.697852559040)
            (0.360000 -8.907072573810)
            (0.370000 -8.061377524270)
            (0.380000 -7.165981401600)
            (0.390000 -6.226404620660)
            (0.400000 -5.248439984750)
            (0.410000 -4.238116971040)
            (0.420000 -3.201664556900)
            (0.430000 -2.145472816100)
            (0.440000 -1.076053521940)
            (0.450000 -0.000000000000)
            (10.000000 0.000000000000)
    );
}

// ************************************************************************* //
