cases/Ferrari_200deg/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// ------------------------------------------------------------------------- //
// Production domain
//
// Main wing chord: 0.20 m
//
// Farfield:
//     x = -2.0 -> 4.2 m
//     y = -2.0 -> 2.0 m
//
// Spanwise computational thickness:
//     z = 0.09 -> 0.11 m
//
// The existing rotor, NCC interface and near-field circular stator
// are retained unchanged.
// ------------------------------------------------------------------------- //

// Rotation centre
hingeX     0.290000000000;
hingeY     0.050000000000;

// Circular non-conformal interface radius
rNCC       0.093478150705;

// Existing near-field outer circle
rOuter     0.500000000000;

vertices
(
    // --------------------------------------------------------------------- //
    // Rotor and circular near-field vertices: z = 0.09
    // --------------------------------------------------------------------- //

    (0.260000000000  0.020000000000  0.090000000000) // 0
    (0.320000000000  0.020000000000  0.090000000000) // 1
    (0.320000000000  0.080000000000  0.090000000000) // 2
    (0.260000000000  0.080000000000  0.090000000000) // 3

    (0.223900965744 -0.016099034256  0.090000000000) // 4
    (0.356099034256 -0.016099034256  0.090000000000) // 5
    (0.356099034256  0.116099034256  0.090000000000) // 6
    (0.223900965744  0.116099034256  0.090000000000) // 7

    (-0.063553390593 -0.303553390593 0.090000000000) // 8
    ( 0.643553390593 -0.303553390593 0.090000000000) // 9
    ( 0.643553390593  0.403553390593 0.090000000000) // 10
    (-0.063553390593  0.403553390593 0.090000000000) // 11

    // --------------------------------------------------------------------- //
    // Rotor and circular near-field vertices: z = 0.11
    // --------------------------------------------------------------------- //

    (0.260000000000  0.020000000000  0.110000000000) // 12
    (0.320000000000  0.020000000000  0.110000000000) // 13
    (0.320000000000  0.080000000000  0.110000000000) // 14
    (0.260000000000  0.080000000000  0.110000000000) // 15

    (0.223900965744 -0.016099034256  0.110000000000) // 16
    (0.356099034256 -0.016099034256  0.110000000000) // 17
    (0.356099034256  0.116099034256  0.110000000000) // 18
    (0.223900965744  0.116099034256  0.110000000000) // 19

    (-0.063553390593 -0.303553390593 0.110000000000) // 20
    ( 0.643553390593 -0.303553390593 0.110000000000) // 21
    ( 0.643553390593  0.403553390593 0.110000000000) // 22
    (-0.063553390593  0.403553390593 0.110000000000) // 23

    // --------------------------------------------------------------------- //
    // New rectangular production farfield: z = 0.09
    // --------------------------------------------------------------------- //

    (-2.000000000000 -2.000000000000 0.090000000000) // 24
    ( 4.200000000000 -2.000000000000 0.090000000000) // 25
    ( 4.200000000000  2.000000000000 0.090000000000) // 26
    (-2.000000000000  2.000000000000 0.090000000000) // 27

    // --------------------------------------------------------------------- //
    // New rectangular production farfield: z = 0.11
    // --------------------------------------------------------------------- //

    (-2.000000000000 -2.000000000000 0.110000000000) // 28
    ( 4.200000000000 -2.000000000000 0.110000000000) // 29
    ( 4.200000000000  2.000000000000 0.110000000000) // 30
    (-2.000000000000  2.000000000000 0.110000000000) // 31
);

blocks
(
    // ===================================================================== //
    // Rotor: retained unchanged
    // ===================================================================== //

    // Central square
    hex (0 1 2 3 12 13 14 15)
        rotor
        (32 32 4)
        simpleGrading (1 1 1)

    // Central square to circular NCC interface
    hex (4 5 1 0 16 17 13 12)
        rotor
        (32 24 4)
        simpleGrading (1 1 1)

    hex (5 6 2 1 17 18 14 13)
        rotor
        (32 24 4)
        simpleGrading (1 1 1)

    hex (6 7 3 2 18 19 15 14)
        rotor
        (32 24 4)
        simpleGrading (1 1 1)

    hex (7 4 0 3 19 16 12 15)
        rotor
        (32 24 4)
        simpleGrading (1 1 1)

    // ===================================================================== //
    // Near-field stator: retained unchanged
    // ===================================================================== //

    // Bottom
    hex (8 9 5 4 20 21 17 16)
        stator
        (32 64 4)
        simpleGrading (1 1 1)

    // Right
    hex (9 10 6 5 21 22 18 17)
        stator
        (32 64 4)
        simpleGrading (1 1 1)

    // Top
    hex (10 11 7 6 22 23 19 18)
        stator
        (32 64 4)
        simpleGrading (1 1 1)

    // Left
    hex (11 8 4 7 23 20 16 19)
        stator
        (32 64 4)
        simpleGrading (1 1 1)

    // ===================================================================== //
    // New outer stator: circular near-field to rectangular farfield
    //
    // Local second direction runs from the farfield towards the circular
    // near-field. An expansion ratio of 0.05 therefore makes the cells
    // progressively smaller towards the circle.
    // ===================================================================== //

    // Lower outer region
    hex (24 25 9 8 28 29 21 20)
        stator
        (32 96 4)
        simpleGrading (1 0.05 1)

    // Right outer region / extended wake
    hex (25 26 10 9 29 30 22 21)
        stator
        (32 96 4)
        simpleGrading (1 0.05 1)

    // Upper outer region
    hex (26 27 11 10 30 31 23 22)
        stator
        (32 96 4)
        simpleGrading (1 0.05 1)

    // Left outer region
    hex (27 24 8 11 31 28 20 23)
        stator
        (32 96 4)
        simpleGrading (1 0.05 1)
);

edges
(
    // NCC circle: z = 0.09
    arc 4 5 90 (0 0 1)
    arc 5 6 90 (0 0 1)
    arc 6 7 90 (0 0 1)
    arc 7 4 90 (0 0 1)

    // Circular near-field outer edge: z = 0.09
    arc 8 9 90 (0 0 1)
    arc 9 10 90 (0 0 1)
    arc 10 11 90 (0 0 1)
    arc 11 8 90 (0 0 1)

    // NCC circle: z = 0.11
    arc 16 17 90 (0 0 1)
    arc 17 18 90 (0 0 1)
    arc 18 19 90 (0 0 1)
    arc 19 16 90 (0 0 1)

    // Circular near-field outer edge: z = 0.11
    arc 20 21 90 (0 0 1)
    arc 21 22 90 (0 0 1)
    arc 22 23 90 (0 0 1)
    arc 23 20 90 (0 0 1)
);

boundary
(
    // All four outer rectangular boundaries remain one farfield patch.
    // This preserves compatibility with the current 0/* boundary conditions.
    farfield
    {
        type patch;

        faces
        (
            // Lower
            (24 28 29 25)

            // Right
            (25 29 30 26)

            // Upper
            (27 26 30 31)

            // Left
            (24 27 31 28)
        );
    }

    front
    {
        type symmetryPlane;

        faces
        (
            // Rotor
            (0 1 2 3)

            (4 5 1 0)
            (5 6 2 1)
            (6 7 3 2)
            (7 4 0 3)

            // Circular near-field stator
            (8 9 5 4)
            (9 10 6 5)
            (10 11 7 6)
            (11 8 4 7)

            // Outer production stator
            (24 25 9 8)
            (25 26 10 9)
            (26 27 11 10)
            (27 24 8 11)
        );
    }

    back
    {
        type symmetryPlane;

        faces
        (
            // Rotor
            (12 15 14 13)

            (16 12 13 17)
            (17 13 14 18)
            (18 14 15 19)
            (19 15 12 16)

            // Circular near-field stator
            (20 16 17 21)
            (21 17 18 22)
            (22 18 19 23)
            (23 19 16 20)

            // Outer production stator
            (28 20 21 29)
            (29 21 22 30)
            (30 22 23 31)
            (31 23 20 28)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
